rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
int CLI_init(void)
{
    UART_Params uartParams;

    UART_Params_init(&uartParams);

    uartParams.readMode       = UART_MODE_BLOCKING;
    uartParams.writeMode      = UART_MODE_BLOCKING;
    uartParams.readTimeout    = 1000;                   // 1 second read timeout
    uartParams.writeTimeout   = BIOS_WAIT_FOREVER;
    uartParams.readCallback   = NULL;
    uartParams.writeCallback  = NULL;
    uartParams.readReturnMode = UART_RETURN_FULL;
    uartParams.writeDataMode  = UART_DATA_BINARY;
    uartParams.readDataMode   = UART_DATA_BINARY;
    uartParams.readEcho       = UART_ECHO_OFF;
    uartParams.baudRate       = 115200;
    uartParams.stopBits       = UART_STOP_ONE;
    uartParams.parityType     = UART_PAR_NONE;

    s_handleUart = UART_open(Board_UART_RS232_COM1, &uartParams);

    if (s_handleUart == NULL)
        System_abort("Error initializing UART\n");

    return 1;
}

//*****************************************************************************
// Startup the command line task
//*****************************************************************************

Bool CLI_startup(void)
{
    Error_Block eb;
    Task_Params taskParams;

    Error_init(&eb);

    Task_Params_init(&taskParams);

    taskParams.stackSize = 3072;
    taskParams.priority  = 11;
    taskParams.arg0      = 0;
    taskParams.arg1      = 0;

    Task_create((Task_FuncPtr)CLITaskFxn, &taskParams, &eb);

    return TRUE;
}

//*****************************************************************************
// The main command line interface task.
//*****************************************************************************

Void CLITaskFxn(UArg arg0, UArg arg1)
{
    uint8_t ch;
    int cnt = 0;

    f_chdir("0://.");

    /* Get the current working directory of the SD drive */
    _getcwd();

    /* Display initial welcome and prompt */
    CLI_home();
    CLI_about();
    CLI_puts("\nEnter 'help' to view list of valid commands\n");
    CLI_prompt();

    while (true)
    {
        /* Read a character from the console */
        if (UART_read(s_handleUart, &ch, 1) == 1)
        {
            if (ch == CRET)
            {
                if (cnt)
                {
                    CLI_putc(CRET);
                    CLI_putc(LF);
                    /* save command for previous recall */
                    strcpy(s_cmdprev, s_cmdbuf);
                    /* parse new command and execute */
                    parse_cmd(s_cmdbuf);
                    /* reset the command buffer */
                    s_cmdbuf[0] = 0;
                    cnt = 0;
                }
                CLI_prompt();
            }
            else if (ch == BKSPC)
            {
                if (cnt)
                {
                    s_cmdbuf[--cnt] = 0;
                    CLI_putc(BKSPC);
                    CLI_putc(' ');
                    CLI_putc(BKSPC);
                }
            }
            else if (ch == CTL_Z)
            {
                /* restore previous command */
                strcpy(s_cmdbuf, s_cmdprev);
                cnt = strlen(s_cmdbuf);
                CLI_printf("%s", s_cmdbuf);
            }
            else
            {
                if (cnt < MAX_CHARS)
                {
                    if (isalnum((int)ch) || strchr(s_delim, (int)ch) || (ch == '.') || (ch == '*'))
                    {
                        s_cmdbuf[cnt++] = tolower(ch);
                        s_cmdbuf[cnt] = 0;
                        CLI_putc((int)ch);
                    }
                }
            }
        }
    }
}

//*****************************************************************************
// Low level tty interface and helper functions
//*****************************************************************************

void CLI_about(void)
{
    CLI_printf("STC-1200 [Version %d.%02d.%03d]\n", FIRMWARE_VER, FIRMWARE_REV, FIRMWARE_BUILD);
    CLI_puts("(C) 2021 RTZ Professional Audio. All Rights Reserved.\n");
}

int CLI_getc(void)
{
    int ch;

    /* Read a character from the console */
    if (UART_read(s_handleUart, &ch, 1) == 1)
        return ch;

    return -1;
}

void CLI_putc(int ch)
{
    if (ch == '\n')
    {
        ch = '\r';
        UART_write(s_handleUart, &ch, 1);
        ch = '\n';
    }

    UART_write(s_handleUart, &ch, 1);
}

void CLI_puts(char* s)
{
    int i;
    int l = strlen(s);

    for (i=0; i < l; i++)
        CLI_putc(*s++);
}

void CLI_printf(const char *fmt, ...)
{
    va_list arg;
    static char buf[128];
    va_start(arg, fmt);
    vsnprintf(buf, sizeof(buf)-1, fmt, arg);
    va_end(arg);
    CLI_puts(buf);
}

void CLI_prompt(void)
{
    CLI_putc(LF);
    CLI_puts(s_cwd);
    CLI_putc('>');
}

void CLI_home(void)
{
    CLI_printf(VT100_HOME);
    CLI_printf(VT100_CLS);
}

void CLI_crlf(int n)
{
    CLI_emit('\n', n);
}

void CLI_emit(char c, int n)
{
    if (n > 0)
    {
        do {
            CLI_putc(c);
        } while(--n);
    }
}

//*****************************************************************************
//
//*****************************************************************************

int parse_args(char *buf)
{
    int argc = 0;

    const char* tok = strtok(NULL, s_delim);

    if (!tok)
        return 0;

    while (tok != NULL)
    {
        s_argv[argc] = strncpy(s_args[argc], tok, MAX_ARG_LEN-1);

        if (++argc >= MAX_ARGS)
            break;

        tok = strtok(NULL, s_delim);
    }

    return argc;
}

void parse_cmd(char *buf)
{
    char* tok = strtok(buf, s_delim);

    if (!tok)
        return;

    /* parse args into array */
    s_argc = parse_args(tok);

    int i = NUM_CMDS;

    while(i--)
    {
        cmd_t cur = dispatch[i];

        if (!strncmp(tok, cur.name, strlen(cur.name)))
        {
            cur.func(s_argc, s_argv);
            return;
        }
    }

    CLI_puts("Command not found.\n");
}

//*****************************************************************************
// FILE SYSTEM HELPER FUNCTIONS
//*****************************************************************************

/* List files in a directory with time, date, size and file name */

FRESULT _dirlist(char* path)
{
    FRESULT res;
    DIR dir;
    static char buf[_MAX_LFN];
    static FILINFO fno;

    /* Open the directory */
    if ((res = f_opendir(&dir, path)) != FR_OK)
    {
        CLI_printf("%s\n", FS_GetErrorStr(res));
    }
    else
    {
        for (;;)
        {
            /* Read a directory item */
            res = f_readdir(&dir, &fno);

            /* Break on error or end of dir */
            if (res != FR_OK || fno.fname[0] == 0)
                break;

            if (fno.fattrib & AM_SYS)
                continue;

            /* Print the file date */
            FS_GetDateStr(fno.fdate, buf, sizeof(buf));
            CLI_puts(buf);
            CLI_emit(' ', 2);

            FS_GetTimeStr(fno.ftime, buf, sizeof(buf));
            CLI_puts(buf);

            if (fno.fattrib & AM_DIR)
                sprintf(buf, "%-15s", "<DIR>");
            else
                sprintf(buf, "%15u", fno.fsize);

            if (fno.lfname)
                CLI_printf("    %s %s\n", buf, fno.lfname);
            else
                CLI_printf("    %s %s\n", buf, fno.fname);
        }

        f_closedir(&dir);
    }

    return res;
}

/* Update and return the current working directory */

char* _getcwd(void)
{
    FRESULT res;

