rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
    res = f_getcwd(s_cwd, sizeof(s_cwd)-1);

    if (res != FR_OK)
    {
        s_cwd[0] = 0;
    }

    return s_cwd;
}

/* Print file system error message */

void _perror(FRESULT res)
{
    CLI_printf("%s\n", FS_GetErrorStr(res));
}

/* Acknowledge successful command with new line, or error message */

FRESULT _checkcmd(FRESULT res)
{
    if (res == FR_OK)
        CLI_putc('\n');
    else
        _perror(res);

    return res;
}

//*****************************************************************************
// BASIC CLI COMMANDS
//*****************************************************************************

void cmd_help(int argc, char *argv[])
{
    char name[16];
    int x, len;
    int i = NUM_CMDS;

    CLI_puts("\nAvailable Commands:\n\n");

    //while(i--)

    for(i=0; i < NUM_CMDS; i++)
    {
        cmd_t cmd = dispatch[i];

        len = strlen(cmd.name);

        for (x=0; x < len; x++)
        {
            name[x] = toupper(cmd.name[x]);
            name[x+1] = 0;

            if (x >= sizeof(name)-1)
                break;
        }

        CLI_printf(" %-10s%s\n", name, cmd.doc);
    }
}

void cmd_about(int argc, char *argv[])
{
    CLI_about();
}

void cmd_cls(int argc, char *argv[])
{
    CLI_home();
}

//*****************************************************************************
// GENERAL SYSTEM COMMANDS
//*****************************************************************************

void cmd_sn(int argc, char *argv[])
{
    char serialnum[64];
    /*  Format the 64 bit GUID as a string */
    GetHexStr(serialnum, g_sys.ui8SerialNumber, 16);
    CLI_printf("%s\n", serialnum);
}

void cmd_ip(int argc, char *argv[])
{
    CLI_printf("%s\n", g_sys.ipAddr);
}

void cmd_mac(int argc, char *argv[])
{
    char mac[32];
    sprintf(mac, "%02X:%02X:%02X:%02X:%02X:%02X",
            g_sys.ui8MAC[0], g_sys.ui8MAC[1], g_sys.ui8MAC[2],
            g_sys.ui8MAC[3], g_sys.ui8MAC[4], g_sys.ui8MAC[5]);
    CLI_printf("%s\n", mac);
}

void cmd_stat(int argc, char *argv[])
{
    CLI_printf("\nSystem Status\n\n");
    CLI_printf("  Tape roller tach   : %u\n", (uint32_t)g_sys.tapeTach);
    CLI_printf("  Tape roller errors : %u\n", g_sys.qei_error_cnt);
    CLI_printf("  Encoder position   : %d\n", g_sys.tapePosition);
    CLI_printf("  Tape Speed         : %d IPS\n", g_cfg.tapeSpeed);
    CLI_printf("  RTC clock type     : %s\n", (g_sys.rtcFound) ? "RTC ext" : "cpu");
    CLI_printf("  DCS controller     : ");
    if (g_sys.dcsFound)
        CLI_printf("%d track\n", g_sys.trackCount);
    else
        CLI_printf("(n/a)\n");
    CLI_printf("  SMPTE controller   : ");
    if (g_sys.smpteFound)
        CLI_printf("found\n", g_sys.trackCount);
    else
        CLI_printf("(n/a)\n");
}

void cmd_cfg(int argc, char *argv[])
{
    if (argc == 1)
    {
        if (strcmp(argv[0], "save") == 0)
        {
            ConfigSave(1);
            CLI_puts("Configuration Saved\n");
        }
        else if (strcmp(argv[0], "load") == 0)
        {
            ConfigLoad(1);
            CLI_puts("Configuration Loaded\n");
        }
        else if (strcmp(argv[0], "reset") == 0)
        {
            ConfigReset(1);
            CLI_puts("Configuration Reset\n");
        }
        else
        {
            CLI_puts("Invalid Option\n");
        }
    }
    else
    {
        CLI_puts("Usage: cfg {save|reset|load}\n");
    }
}

//*****************************************************************************
// TAPE TRANSPORT COMMANDS
//*****************************************************************************

void cmd_stop(int argc, char *argv[])
{
    CLI_puts("STOP\n");
    Transport_PostButtonPress(S_STOP);
}

void cmd_play(int argc, char *argv[])
{
    uint32_t mask = S_PLAY;

    if (argc)
    {
        if (strcmp(argv[0], "rec") == 0)
            mask |= S_REC;
    }

    CLI_printf("PLAY%s\n", (mask & S_REC) ? "-REC" : "");

    Transport_PostButtonPress(mask);
}

void cmd_fwd(int argc, char *argv[])
{
    uint32_t mask = 0;

    if (argc)
    {
        if (strcmp(argv[0], "lib") == 0)
            mask |= M_LIBWIND;
    }

    CLI_printf("FWD%s\n", (mask & M_LIBWIND) ? "-LIB" : "");

    Transport_Fwd(0, mask);
}

void cmd_rew(int argc, char *argv[])
{
    uint32_t mask = 0;

    if (argc)
    {
        if (strcmp(argv[0], "lib") == 0)
            mask |= M_LIBWIND;
    }

    CLI_printf("REW%s\n", (mask & M_LIBWIND) ? "-LIB" : "");

    Transport_Rew(0, mask);
}

void cmd_speed(int argc, char *argv[])
{
    CLI_printf("%u IPS\n", g_sys.tapeSpeed);
}

void cmd_rtz(int argc, char *argv[])
{
    LocateSearch(CUE_POINT_HOME, 0);
}

void cmd_cue(int argc, char *argv[])
{
    int loc = 0;

    if (!argc)
    {
        CLI_printf("CUE MODE\n");
        Remote_PostSwitchPress(SW_CUE, 0);
        return;
    }

    loc = atoi(argv[0]);

    if (g_sys.remoteMode != REMOTE_MODE_CUE)
        Remote_PostSwitchPress(SW_CUE, 0);

    CLI_printf("SEARCH TO CUE MEMORY %d\n", loc);

    switch(loc)
    {
    case 0:
        Remote_PostSwitchPress(SW_LOC0, 0);
        break;
    case 1:
        Remote_PostSwitchPress(SW_LOC1, 0);
        break;
    case 2:
        Remote_PostSwitchPress(SW_LOC2, 0);
        break;
    case 3:
        Remote_PostSwitchPress(SW_LOC3, 0);
        break;
    case 4:
        Remote_PostSwitchPress(SW_LOC4, 0);
        break;
    case 5:
        Remote_PostSwitchPress(SW_LOC5, 0);
        break;
    case 6:
        Remote_PostSwitchPress(SW_LOC6, 0);
        break;
    case 7:
        Remote_PostSwitchPress(SW_LOC7, 0);
        break;
    case 8:
        Remote_PostSwitchPress(SW_LOC8, 0);
        break;
    case 9:
        Remote_PostSwitchPress(SW_LOC9, 0);
        break;
    }
}

void cmd_store(int argc, char *argv[])
{
    int loc = 0;

    if (!argc)
    {
        CLI_printf("STORE MODE\n");
        Remote_PostSwitchPress(SW_STORE, 0);
        return;
    }

    loc = atoi(argv[0]);
    CLI_printf("STORE TO MEMORY to %d\n", loc);

    if (g_sys.remoteMode != REMOTE_MODE_STORE)
        Remote_PostSwitchPress(SW_STORE, 0);

    switch(loc)
    {
    case 0:
        Remote_PostSwitchPress(SW_LOC0, 0);
        break;
    case 1:
        Remote_PostSwitchPress(SW_LOC1, 0);
        break;
    case 2:
        Remote_PostSwitchPress(SW_LOC2, 0);
        break;
    case 3:
        Remote_PostSwitchPress(SW_LOC3, 0);
        break;
    case 4:
        Remote_PostSwitchPress(SW_LOC4, 0);
        break;
    case 5:
        Remote_PostSwitchPress(SW_LOC5, 0);
        break;
    case 6:
        Remote_PostSwitchPress(SW_LOC6, 0);
        break;
    case 7:
        Remote_PostSwitchPress(SW_LOC7, 0);
        break;
    case 8:
        Remote_PostSwitchPress(SW_LOC8, 0);
        break;
    case 9:
        Remote_PostSwitchPress(SW_LOC9, 0);
        break;
    }
}

