rtzaudio/STC1200_TivaTM4C1294NCPDT/CLITask.c
void cmd_smpte(int argc, char *argv[])
{
    if (argc < 1)
    {
        CLI_puts("Missing Argument\n");
        return;
    }

    CLI_puts("SMPTE generator ");

    if (!g_sys.smpteFound)
    {
        CLI_puts("not installed!\n");
        return;
    }

    if (strcmp(argv[0], "start") == 0)
    {
        SMPTE_generator_start();
        CLI_puts("START\n");
    }
    else if (strcmp(argv[0], "stop") == 0)
    {
        SMPTE_generator_stop();
        CLI_puts("STOP\n");
    }
    else if (strcmp(argv[0], "resume") == 0)
    {
        SMPTE_generator_resume();
        CLI_puts("RESUME\n");
    }
    else if (strcmp(argv[0], "revid") == 0)
    {
        char buf[16];
        uint16_t revid = 0;
        SMPTE_get_revid(&revid);
        sprintf(buf, "REVID %04X\n", revid);
        CLI_puts(buf);
    }
    else
    {
        CLI_puts("\n\nUsage: smpte {start|stop|resume|revid}\n");
    }
}

//*****************************************************************************
// TIME AND DATE COMMANDS
//*****************************************************************************

void cmd_time(int argc, char *argv[])
{
    char timeFmt[] = "Current time: %d:%02d:%02d\n";
    char timeSet[] = "Time set!\n";
    char timeAs[]  = "Enter time as: hh:mm:ss\n";

    if (g_sys.rtcFound)
    {
        RTCC_Struct ts;

        if (argc == 0)
        {
            if (!RTC_IsRunning())
                return;

            MCP79410_GetTime(g_sys.handleRTC, &ts);

            CLI_printf(timeFmt, ts.hour, ts.min, ts.sec);
        }
        else if (argc == 3)
        {
            /* Get current time/date */
            MCP79410_GetTime(g_sys.handleRTC, &ts);

            ts.hour    = (uint8_t)atoi(argv[0]);
            ts.min     = (uint8_t)atoi(argv[1]);
            ts.sec     = (uint8_t)atoi(argv[2]);

            MCP79410_SetHourFormat(g_sys.handleRTC, H24);                // Set hour format to military time standard
            MCP79410_EnableVbat(g_sys.handleRTC);                        // Enable battery backup
            MCP79410_SetTime(g_sys.handleRTC, &ts);
            MCP79410_EnableOscillator(g_sys.handleRTC);                  // Start clock by enabling oscillator

            CLI_puts(timeSet);
        }
        else
        {
            CLI_puts(timeAs);
        }
    }
    else
    {
        struct tm stime;

        if (argc == 0)
        {
            // Get the latest time.
            HibernateCalendarGet(&stime);

            // Is valid data read?
            if (!RTC_IsValidTime(&stime))
            {
                CLI_puts("Time has not been set yet\n");
            }
            else
            {
                CLI_printf(timeFmt, stime.tm_hour, stime.tm_min, stime.tm_sec);
            }
        }
        else if (argc == 3)
        {
            // Get the latest date and time.
            HibernateCalendarGet(&stime);

            // Set the time values that are to be updated.
            stime.tm_hour = atoi(argv[0]);
            stime.tm_min  = atoi(argv[1]);
            stime.tm_sec  = atoi(argv[2]);

            // Update the calendar logic of hibernation module.
            HibernateCalendarSet(&stime);

            CLI_puts(timeSet);
        }
        else
        {
            CLI_puts(timeAs);
        }
    }
}

void cmd_date(int argc, char *argv[])
{
    char dateFmt[] = "Current date: %d/%d/%d\n";
    char dateSet[] = "Date set!\n";
    char dateAs[]  = "Enter date as: mm/dd/yyyy\n";

    if (g_sys.rtcFound)
     {
        RTCC_Struct ts;

        if (argc == 0)
        {
            if (!RTC_IsRunning())
                return;

            MCP79410_GetTime(g_sys.handleRTC, &ts);

            CLI_printf(dateFmt, ts.month, ts.date, ts.year+2000);
        }
        else if (argc == 3)
        {
            /* Get current time/date */
            MCP79410_GetTime(g_sys.handleRTC, &ts);

            ts.month   = (uint8_t)atoi(argv[0]);
            ts.date    = (uint8_t)atoi(argv[1]);
            ts.year    = (uint8_t)(atoi(argv[2]) - 2000);
            ts.weekday = (uint8_t)((ts.date % 7) + 1);

            MCP79410_SetHourFormat(g_sys.handleRTC, H24);                // Set hour format to military time standard
            MCP79410_EnableVbat(g_sys.handleRTC);                        // Enable battery backup
            MCP79410_SetTime(g_sys.handleRTC, &ts);
            MCP79410_EnableOscillator(g_sys.handleRTC);                  // Start clock by enabling oscillator

            CLI_puts(dateSet);
        }
        else
        {
            CLI_puts(dateAs);
        }
     }
    else
    {
        struct tm stime;

        if (argc == 0)
        {
            // Get the latest time.
            HibernateCalendarGet(&stime);

            // Is valid data read?
            if (!RTC_IsValidDate(&stime))
            {
                CLI_puts("Date has not been set yet\n");
            }
            else
            {
                CLI_printf(dateFmt,
                           stime.tm_mon,
                           stime.tm_mday,
                           stime.tm_year + 1900);
            }
        }
        else if (argc == 3)
        {
            // Get the latest date and time.
            HibernateCalendarGet(&stime);

            // Set the date values that are to be updated.
            stime.tm_mon  = atoi(argv[0]);
            stime.tm_mday = atoi(argv[1]);
            stime.tm_year = atoi(argv[2]) - 1900;

            // Update the calendar logic of hibernation module.
            HibernateCalendarSet(&stime);

            CLI_puts(dateSet);
        }
        else
        {
            CLI_puts(dateAs);
        }
    }
}

//*****************************************************************************
// FILE SYSTEM COMMANDS
//*****************************************************************************

void cmd_dir(int argc, char *argv[])
{
    static char buf[MAX_PATH];

    CLI_printf("\n Directory of %s\n\n", s_cwd);

    strcpy(buf, ".");

    if (argc >= 1)
    {
        strncpy(buf, argv[0], sizeof(buf)-1);
        buf[sizeof(buf)-1] = 0;
    }

